#sip.conf

Добавление клиента
```
[general]
[1000]
type=friend ;user,friend,peer 
context=phones ;
host=dynamic ;динамически или статический ip телефоне
secret=password
```

Из книги
```
[general]
context=default ; Контекст по умолчанию для входящих
                ; вызовов
allowoverlap=no ; Отключить поддержку набора номера
                ; в режиме overlap.
                ; (Значение по умолчанию - yes)
bindport=5060 ; Используемый UDP-порт 5060
               ; (стандартный SIP-порт)
              ; bindport – локальный UDP-порт,
               ; который будет слушать Asterisk
bindaddr=0.0.0.0 ; Используемый IP-адрес 0.0.0.0
                ; (все доступные адреса)
srvlookup=yes ; Активировать поиск DNS SRV-записей
               ; для исходящих вызовов
               ; Примечание: Asterisk использует
               ; только первый хост в SRV-записях
               ; Деактивация поиска DNS SRV-записей
                ; отключает возможность размещать
                ; SIP-вызовы к другим SIP-пользователям
                 ; в Интернете на основании доменных имен
[authentication]
```
